_posts/2022-03-10-post-google-more.html
---
title:  CTF evening
categories:
  - blog
tags:
    - CTF
---

<p>
So I had a silent hour and decided to play a litte CTF, I already did some recon on this challange, and was already able to get to the machine.
</p>

<p>
Via an old apache RCE.
</p>

<p>
Generally everthing would have been quite straight forward. But I have two major takeaways today.
</p>

<ol class="org-ol">
<li>Do not give up easily&#x2026;. most of the time I'm on the right path but doubt myselfe.</li>
<li>Inside a Docker-container, it might be worth to scan the network :)</li>
</ol>
